# 3、企业发放的奖金根据利润提成。
# 利润(I)低于或等于10万元时，奖金可提10%；
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；
# 20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成。
# 编写一个Python程序Commission.py，用户从键盘输入当月利润I，输出应发放奖金总数。


I = float(input("请输入当月利润I(单位:万):"))
P = 0.0
It = [0,10,20,40,60,100]
Cent =[0.1,0.075,0.05,0.03,0.015,0.01]

for i in range (5,-1,-1):
    if I>It[i]:
        M = I-It[i]
        P +=M*Cent[i]
        I -=M

print(f"应发放奖金: {P:.2f}万")